In [1]:
import re
text = "Nancy    George\t Bess\nNed"
sylList = re.split('\s+', text)
sylList

import pandas as pd
df = pd.DataFrame(sylList, columns = ['Employee'], index = ['001', '010', '011', '100'])
df

    Employee
001    Nancy
010   George
011     Bess
100      Ned

In [21]:
import pandas as pd
df = pd.DataFrame(sylList, columns = ['Employee'], index = ['001', '010', '011', '100'])
df

    Employee
001    Nancy
010   George
011     Bess
100      Ned

In [22]:
df['New Employee'] = df

In [23]:
df

    Employee New Employee
001    Nancy        Nancy
010   George       George
011     Bess         Bess
100      Ned          Ned

In [19]:
df.drop(['New Employee'], axis = 'columns')

    Employee
001    Nancy
010   George
011     Bess
100      Ned

In [20]:
df.drop(['001','010'],'index')

    Employee New Employee
011     Bess         Bess
100      Ned          Ned